;汉化：aotix

[Tech_LegionChassis X2TechTemplate]
DisplayName="军团底盘"
Summary="一种重型SPARK机甲底盘，提供出色的保护和生存能力，但以正常底盘机动性为代价。该底盘赋予SPARK单位新的战斗能力，使其能够以重型火力支援我们的小队。"
CodeName="军团"

[Tech_SPARKCannon_LS X2TechTemplate]
DisplayName="BSG-12激光微型机枪"
Summary="加特林机炮是普通士兵携带的迷你机关枪的更重型版本。这种坚固的武器提供强大的火力，只能由我们的SPARK使用。现在，通过激光武器技术的进一步改进，它的能力得到了提升。"

[Tech_SPARKCannon_MG X2TechTemplate]
DisplayName="BSG-17轨道炮"
Summary="加特林机炮是普通士兵携带的微型机枪的更重型版本。这种坚固的武器提供强大的火力，只能由我们的SPARK使用。现在，通过磁性武器技术的进一步改进，它的能力得到了提升。"

[Tech_SPARKCannon_CG X2TechTemplate]
DisplayName="BSG-20高斯炮"
Summary="加特林机炮是普通士兵携带的微型机枪的更重型版本。这种坚固的武器提供强大的火力，只能由我们的SPARK使用。现在，通过线圈武器技术的进一步改进，它的能力得到了提升。"

[Tech_SPARKCannon_BM X2TechTemplate]
DisplayName="BSG-25光束微型机枪"
Summary="加特林机炮是普通士兵携带的微型机枪的更重型版本。这种坚固的武器提供强大的火力，只能由我们的SPARKs使用。现在，通过电浆武器技术的进一步改进，它的能力得到了提升。"

[SPARKCannon_CV X2WeaponTemplate]
FriendlyName="BSG-09加特林炮"
FriendlyNamePlural="BSG-09加特林炮"
BriefSummary="这是一款专为SPARK设计的强大而重型的火炮。"
TacticalText="<Bullet/>在没有特殊训练的情况下，使用主武器会结束回合。"
AbilityDescName="BSG-09加特林炮"

[SPARKCannon_LS X2WeaponTemplate]
FriendlyName="BSG-12激光微型机枪"
FriendlyNamePlural="BSG-12激光微型机枪"
BriefSummary="这是一款专为SPARK设计的强大而重型的火炮。"
TacticalText="<Bullet/>在没有特殊训练的情况下，使用主武器会结束回合。"
AbilityDescName="BSG-12激光微型机枪"

[SPARKCannon_MG X2WeaponTemplate]
FriendlyName="BSG-17轨道炮"
FriendlyNamePlural="BSG-17轨道炮"
BriefSummary="这是一款专为SPARK设计的强大而重型的火炮。"
TacticalText="<Bullet/>在没有特殊训练的情况下，使用主武器会结束回合。"
AbilityDescName="BSG-17轨道炮"

[SPARKCannon_CG X2WeaponTemplate]
FriendlyName="BSG-20高斯炮"
FriendlyNamePlural="BSG-20高斯炮"
BriefSummary="这是一款专为SPARK设计的强大而重型的火炮。"
TacticalText="<Bullet/>在没有特殊训练的情况下，使用主武器会结束回合。"
AbilityDescName="BSG-20高斯炮"

[SPARKCannon_BM X2WeaponTemplate]
FriendlyName="BSG-25光束微型机枪"
FriendlyNamePlural="BSG-25光束微型机枪"
BriefSummary="这是一款专为SPARK设计的强大而重型的火炮。"
TacticalText="<Bullet/>在没有特殊训练的情况下，使用主武器会结束回合。"
AbilityDescName="BSG-25光束微型机枪"

[LegionModeSwitch_Short X2AbilityTemplate]
LocFriendlyName="近战模式"
LocLongDescription="切换至近战模式。接近目标可以提高准确性和暴击几率。"
LocHelpText="切换至近战模式。接近目标可以提高准确性和暴击几率。"
LocFlyOverText="近战模式"

[LegionModeSwitch_Long X2AbilityTemplate]
LocFriendlyName="远程模式"
LocLongDescription="切换至远程模式，增加视野范围。与目标的距离增加可以提高准确性和暴击几率。"
LocHelpText="切换至远程模式，增加视野范围。与目标的距离增加可以提高准确性和暴击几率。"
LocFlyOverText="远程模式"

[LegionGunShield X2AbilityTemplate]
LocFriendlyName="枪盾"
LocLongDescription="在武器前方投射能量护盾，阻挡来袭的攻击并向攻击者进行反击。持续1回合或吸收20点伤害后消失。"
LocHelpText="吸收最多20点伤害并向攻击者进行反击。无法在移动后使用。持续1回合。"
LocFlyOverText="枪盾"

[LegionGunShieldMk2 X2AbilityTemplate]
LocFriendlyName="枪盾"
LocLongDescription="在武器前方投射能量护盾，阻挡来袭的攻击并向攻击者进行反击。持续1回合或吸收30点伤害后消失。"
LocHelpText="吸收最多30点伤害并向攻击者进行反击。无法在移动后使用。持续1回合。"
LocFlyOverText="枪盾"

[LegionPowerShot_Long X2AbilityTemplate]
LocFriendlyName="强力射击（远程）"
LocLongDescription="发射一枚远程弹道，穿透并对直线上的所有单位造成伤害。"
LocHelpText="发射一枚远程弹道，穿透并对直线上的所有单位造成伤害。"

[LegionPowerShot_Short X2AbilityTemplate]
LocFriendlyName="强力射击（近战）"
LocLongDescription="发射一团短程弹道，对锥形范围内的所有单位造成伤害。"
LocHelpText="发射一团短程弹道，对锥形范围内的所有单位造成伤害。"

[LegionSmartCore X2AbilityTemplate]
LocFriendlyName="智能核心"
LocLongDescription="释放主武器剩余的所有弹药（+6发）对视野内的敌人进行攻击。最多射击12次，每次射击的命中率为100%。"
LocHelpText="释放主武器剩余的所有弹药（+6发）对视野内的敌人进行攻击。最多射击12次，每次射击的命中率为100%。"
LocFlyOverText="智能核心"

[LegionSmartCoreMk2 X2AbilityTemplate]
LocFriendlyName="智能核心"
LocLongDescription="释放主武器剩余的所有弹药（+8发）对视野内的敌人进行攻击。最多射击16次，每次射击的命中率为100%。"
LocHelpText="释放主武器剩余的所有弹药（+8发）对视野内的敌人进行攻击。最多射击16次，每次射击的命中率为100%。"
LocFlyOverText="智能核心"